In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# 日付のデータ生成
dates = pd.date_range('20130101', periods=6)
# 6 * 4のランダムデータを作成し、直前に作成した日付のデータとjoin
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.744435 -0.621530 -0.540596  0.889703
2013-01-02 -1.222495 -0.902568 -0.867088 -0.706643
2013-01-03 -0.558791 -1.345170 -1.120732 -1.683935
2013-01-04  0.052467 -0.431617  1.367197 -1.024915
2013-01-05  0.824056  0.680215 -1.421831 -0.710024
2013-01-06 -0.379591  1.633665 -1.040174 -0.010305

In [3]:
df.iloc[3]

A    0.052467
B   -0.431617
C    1.367197
D   -1.024915
Name: 2013-01-04 00:00:00, dtype: float64

In [4]:
 df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.052467 -0.431617
2013-01-05  0.824056  0.680215

In [5]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.222495 -0.867088
2013-01-03 -0.558791 -1.120732
2013-01-05  0.824056 -1.421831

In [6]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.222495 -0.902568 -0.867088 -0.706643
2013-01-03 -0.558791 -1.345170 -1.120732 -1.683935

In [7]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.621530 -0.540596
2013-01-02 -0.902568 -0.867088
2013-01-03 -1.345170 -1.120732
2013-01-04 -0.431617  1.367197
2013-01-05  0.680215 -1.421831
2013-01-06  1.633665 -1.040174

In [8]:
 df.iloc[1,1]

-0.9025681379750907

In [9]:
df.iat[1,1]

-0.9025681379750907

In [10]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.744435 -0.621530 -0.540596  0.889703
2013-01-04  0.052467 -0.431617  1.367197 -1.024915
2013-01-05  0.824056  0.680215 -1.421831 -0.710024

In [11]:
# 取得対象の条件指定
[df > 0]

[                A      B      C      D
 2013-01-01   True  False  False   True
 2013-01-02  False  False  False  False
 2013-01-03  False  False  False  False
 2013-01-04   True  False   True  False
 2013-01-05   True   True  False  False
 2013-01-06  False   True  False  False]

In [12]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.744435       NaN       NaN  0.889703
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  0.052467       NaN  1.367197       NaN
2013-01-05  0.824056  0.680215       NaN       NaN
2013-01-06       NaN  1.633665       NaN       NaN

In [13]:
df2 = df.copy()

In [14]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.744435 -0.621530 -0.540596  0.889703    one
2013-01-02 -1.222495 -0.902568 -0.867088 -0.706643    one
2013-01-03 -0.558791 -1.345170 -1.120732 -1.683935    two
2013-01-04  0.052467 -0.431617  1.367197 -1.024915  three
2013-01-05  0.824056  0.680215 -1.421831 -0.710024   four
2013-01-06 -0.379591  1.633665 -1.040174 -0.010305  three

In [15]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [16]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D
2013-01-01  0.000000 -0.621530 -0.540596  0.889703
2013-01-02 -1.222495 -0.902568 -0.867088 -0.706643
2013-01-03 -0.558791 -1.345170 -1.120732 -1.683935
2013-01-04  0.052467 -0.431617  1.367197 -1.024915
2013-01-05  0.824056  0.680215 -1.421831 -0.710024
2013-01-06 -0.379591  1.633665 -1.040174 -0.010305

In [17]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D
2013-01-01  0.000000 -0.621530 -0.540596  5
2013-01-02 -1.222495 -0.902568 -0.867088  5
2013-01-03 -0.558791 -1.345170 -1.120732  5
2013-01-04  0.052467 -0.431617  1.367197  5
2013-01-05  0.824056  0.680215 -1.421831  5
2013-01-06 -0.379591  1.633665 -1.040174  5

In [18]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000 -0.621530 -0.540596 -5
2013-01-02 -1.222495 -0.902568 -0.867088 -5
2013-01-03 -0.558791 -1.345170 -1.120732 -5
2013-01-04 -0.052467 -0.431617 -1.367197 -5
2013-01-05 -0.824056 -0.680215 -1.421831 -5
2013-01-06 -0.379591 -1.633665 -1.040174 -5

In [19]:
df3 = df.copy()
df3[df3 > 0] = -df3 * 2
df3

                   A         B         C   D
2013-01-01  0.000000 -0.621530 -0.540596 -10
2013-01-02 -1.222495 -0.902568 -0.867088 -10
2013-01-03 -0.558791 -1.345170 -1.120732 -10
2013-01-04 -0.104934 -0.431617 -2.734395 -10
2013-01-05 -1.648111 -1.360430 -1.421831 -10
2013-01-06 -0.379591 -3.267331 -1.040174 -10

In [20]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000 -0.621530 -0.540596  5  1.0
2013-01-02 -1.222495 -0.902568 -0.867088  5  1.0
2013-01-03 -0.558791 -1.345170 -1.120732  5  NaN
2013-01-04  0.052467 -0.431617  1.367197  5  NaN

In [21]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000 -0.621530 -0.540596  5  1.0
2013-01-02 -1.222495 -0.902568 -0.867088  5  1.0

In [22]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000 -0.621530 -0.540596  5  1.0
2013-01-02 -1.222495 -0.902568 -0.867088  5  1.0
2013-01-03 -0.558791 -1.345170 -1.120732  5  5.0
2013-01-04  0.052467 -0.431617  1.367197  5  5.0

In [23]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True